["44949:A popular saying is \"Nothing ie ever lost on the internet\" but what is something you have been searching for years and you haven\u0027t found it yet?",":Trade in your old device and get savings toward a new Google Pixel 4. Get it now. Terms apply.","40803:I also made a booknook shelf insert","109183:Prince Andrew accuser\u0027s sends out cryptic tweet: \"I am making it publicy known that in no way, shape or form am I sucidal. I have made this known to my therapist and GP- If something happens to me- in the sake of my family do not let this go away and help me to protect them\"","72951:Giant puffball mushroom my sister found in the woods","31778:i love playing video games with my gf ❤️❤️","34091:Someone call an ambulance","20387:Apple CEO Tim Cook says monopolies aren\u0027t bad if they aren\u0027t abused","12967:Locations of American Taco Chains [OC]","22227:It\u0027s Not A Binary Choice","18118:Doctors with flu shots for migrant children turned away from Calif. facility; 6 arrested","56591:LPT: Keep inviting that friend who always says no","17484:Trump claims that \u0027the US is no longer laughed at\u0027 just days after European leaders mocked him","44463:TIL of ablaut reduplication, an unwritten English rule that makes \"tick-tock\" sound normal, but not \"tock-tick\". When repeating words, the first vowel is always an I, then A or O. \"Chit chat\" not \"chat chit\"; \"ping pong\" not \"pong ping\", etc. It\u0027s unclear why this rule exists, but it\u0027s never broken","16321:AITA for laughing at a kid in my nephews play","15178:What in the hell is this lady doing","50963:Ended quite satisfying",":Get unlimited data, talk and text with Google Fi\u0027s Unlimited plan starting at $45 /line.","38073:I have no words","32341:Everyone knows you can\u0027t play video games without a penis!","16522:Photographer Murat Öztürk captured this stunning scene containing an ant trying to take down a flying wasp.","27639:U of Phoenix agrees to cancel $141 million in student loan debt","41752:A couple of mouthwatering gyros with fries","32580:It still blows my mind that this is a 1TB storage device.","51304:not sure if this is the right place to post but my dad is 52 y/o and his hobby is making these weird heads? he doesn’t think they’re any good but considering he makes them from scratch i think they’re amazing!","34962:What am I missing here?","26635:Gaming"]